const testQuiz1 = {
  subject: "소프트웨어 설계",
  question: "객체지향 프로그램에서 데이터를 추상화하는 단위는?",
  questionImg_url: null,
  options: ["메소드", "클래스", "상속성", "메시지"],
  answer: 2,
  solve:
    "메소드: 메소드는 클래스 내부에 정의된 함수로, 특정 작업을 수행하는 코드의 블록입니다. 메소드는 데이터를 처리하거나 조작할 수 있지만 데이터를 추상화하는 단위가 아닙니다. 클래스: 클래스는 객체지향 프로그래밍에서 데이터와 해당 데이터를 처리하는 메소드를 함께 묶어놓은 추상화된 틀입니다. 클래스는 객체를 생성하기 위한 템플릿 역할을 하며, 데이터를 추상화하는 주요 단위입니다. 상속성: 상속성은 객체지향 프로그래밍에서 기존 클래스를 확장하여 새로운 클래스를 만드는 개념입니다. 상속을 통해 기존 클래스의 특성을 재사용하고 확장할 수 있습니다. 데이터를 추상화하는 단위가 아니므로 정답이 아닙니다. 메시지: 메시지는 객체 간의 상호작용을 위해 한 객체가 다른 객체에게 보내는 요청 또는 명령입니다. 메시지를 통해 객체는 다른 객체의 메소드를 호출하거나 데이터를 요청할 수 있습니다. 하지만 데이터를 추상화하는 단위는 아닙니다.",
  last: false,
};

export default testQuiz1;
